# =============================================================================
# ARCH LINUX PACMAN PACKAGES
# =============================================================================
# Uncomment lines to enable optional packages
# Lines starting with # are ignored

# -----------------------------------------------------------------------------
# CORE DEPENDENCIES
# -----------------------------------------------------------------------------
# Core dependencies for dotfiles to function
# Minimal set required by scripts

fzf
git
fd
ripgrep
bat
eza
jq
wl-clipboard
zoxide

# -----------------------------------------------------------------------------
# SYSTEM MONITORING
# -----------------------------------------------------------------------------
# Uncomment if you want alternatives:
# htop           # Classic process monitor
# glances        # Cross-platform monitoring

btop
fastfetch

# -----------------------------------------------------------------------------
# FILE OPERATIONS
# -----------------------------------------------------------------------------
tree
rsync
7zip
yazi

# -----------------------------------------------------------------------------
# FONTS
# -----------------------------------------------------------------------------
ttf-nerd-fonts-symbols
ttf-nerd-fonts-symbols-mono
font-manager

# -----------------------------------------------------------------------------
# NETWORK & DOWNLOAD
# -----------------------------------------------------------------------------
wget
curlie
curl

# -----------------------------------------------------------------------------
# DOCUMENTATION
# -----------------------------------------------------------------------------
tealdeer
glow

# -----------------------------------------------------------------------------
# TERMINAL MULTIPLEXER
# -----------------------------------------------------------------------------
#zellij
tmux

# -----------------------------------------------------------------------------
# OTHER UTILITIES
# -----------------------------------------------------------------------------
coreutils
sed

# -----------------------------------------------------------------------------
# DEVELOPMENT - VERSION CONTROL
# -----------------------------------------------------------------------------
git-delta
difftastic
git-lfs
github-cli
lazygit

# -----------------------------------------------------------------------------
# DEVELOPMENT - EDITORS
# -----------------------------------------------------------------------------
neovim
micro
# -----------------------------------------------------------------------------
# DEVELOPMENT - BUILD TOOLS
# -----------------------------------------------------------------------------
# mise handles runtimes
mise

# -----------------------------------------------------------------------------
# DEVELOPMENT - TOOLCHAINS (C/C++)
# -----------------------------------------------------------------------------
gcc
clang
gdb
cmake
ninja
make

# -----------------------------------------------------------------------------
# LANGUAGE - SHELL
# -----------------------------------------------------------------------------
shellcheck
shfmt

# -----------------------------------------------------------------------------
# DEVELOPMENT - QUALITY & TESTING
# -----------------------------------------------------------------------------
watchexec
editorconfig-checker

# -----------------------------------------------------------------------------
# DEVELOPMENT - DEV TOOLS
# -----------------------------------------------------------------------------
just
lazydocker

# -----------------------------------------------------------------------------
# GUI - TERMINAL
# -----------------------------------------------------------------------------
ghostty
# -----------------------------------------------------------------------------
# GUI - BROWSERS
# -----------------------------------------------------------------------------
firefox
# google-chrome
chromium

# -----------------------------------------------------------------------------
# GUI - PRODUCTIVITY & WINDOW MANAGEMENT
# -----------------------------------------------------------------------------
# flameshot

# -----------------------------------------------------------------------------
# GUI - EDITORS
# -----------------------------------------------------------------------------
# obsidian

# -----------------------------------------------------------------------------
# GUI - COMMUNICATION
# -----------------------------------------------------------------------------
# teams-for-linux

# -----------------------------------------------------------------------------
# GUI - DEVELOPMENT TOOLS
# -----------------------------------------------------------------------------
# github-desktop

# -----------------------------------------------------------------------------
# GUI - SECURITY & ENCRYPTION
# -----------------------------------------------------------------------------
bitwarden
# keepassxc

# -----------------------------------------------------------------------------
# GUI - DATABASE & API TOOLS
# -----------------------------------------------------------------------------
# bruno
# dbeaver
# db-browser-for-sqlite
# mongodb-compass

# -----------------------------------------------------------------------------
# GUI - MOBILE & ANDROID
# -----------------------------------------------------------------------------
# android-tools
# scrcpy

# -----------------------------------------------------------------------------
# GUI - SCREEN SHARING & REMOTE
# -----------------------------------------------------------------------------
# deskreen
# localsend

# -----------------------------------------------------------------------------
# GUI - CONTAINERIZATION
# -----------------------------------------------------------------------------
# docker
